Revit 2027 API
FilteredElementCollector.IsViewValidForElementIteration Method
 Identifies if the particular element is valid for iteration of drawn elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsViewValidForElementIteration(
	Document document,
	ElementId viewId
)
Public Shared Function IsViewValidForElementIteration (
	document As Document,
	viewId As ElementId
) As Boolean
public:
static bool IsViewValidForElementIteration(
	Document^ document,
	ElementId^ viewId
)
static member IsViewValidForElementIteration :
        document : Document *
        viewId : ElementId -> bool
Parameters
document Document
 The document.
viewId ElementId
 The view id.
Return Value
Boolean
 True if the element is valid for iteration.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Views that have no way of representing drawn elements, such as many view templates, fail this check.
See Also
Reference
FilteredElementCollector Class
Autodesk.Revit.DB Namespace